{"pages":[{"title":"友链","text":"Friends Interesting Things","link":"/links/index.html"},{"title":"关于我","text":"本人为华南理工大学 级软件工程专业在校生，此blog用来记录日常与学习心得 可以通过以下方式找到我： WeChat：wsy_jim QQ：3340307001 Github：wsyunine Snapchat：wsy_jim bilibili ：wsy_jim .a{ position: relative; top: 0px; width: 70vh; height: 50px; background-image: url(\"https://s1.ax1x.com/2023/09/05/pPrH9Et.jpg\"); background-size: cover; display: flex; justify-content: center; align-items: center; overflow: hidden; } WSY_JIM","link":"/about/index.html"}],"posts":[{"title":"AppleScript学习笔记","text":"写在前面：在搭建班级代码仓库时遇到了需要编写脚本的问题，所以来学习一下怎么编写 ，感觉用好了这门脚本语言 将会很强大 我不用学了，因为 帮我学了 脚本1： 用来分类文件 在文件夹1下有一些文件，文件名前两个数码为序号，在文件夹2下有一些文件夹，文件夹名为序号，现在要求运行脚本后，存在文件夹1下的所有文件按照序号复制一份到文件夹2下对应名字的文件夹下 12345678910111213141516171819202122232425262728-- 设置文件夹路径set folder1Path to \"路径1\"set folder2Path to \"路径2\"-- 获取文件夹1中的所有文件tell application \"System Events\" set folder1Files to every file of folder folder1Pathend tell-- 遍历文件并复制到相应的文件夹中repeat with aFile in folder1Files set filePath to POSIX path of (aFile as alias) set fileName to name of aFile -- 提取文件名前两个数码作为序号 set serialNumber to text 1 thru 2 of fileName -- 确定目标文件夹的路径 set targetFolder to folder2Path &amp; \"/\" &amp; serialNumber -- 如果目标文件夹不存在，则创建它 do shell script \"mkdir -p \" &amp; quoted form of POSIX path of targetFolder -- 使用 shell 命令复制文件 do shell script \"cp \" &amp; quoted form of filePath &amp; \" \" &amp; quoted form of POSIX path of targetFolderend repeatdisplay dialog \"复制完成！\" 脚本2： 用来创建文件夹 在文件夹中创建名为 01、02、……、62 的总共62个文件夹。 1234567891011-- 设置文件夹1路径set folder1Path to \"路径\" -- 请将路径替换为实际路径-- 创建文件夹repeat with i from 1 to 62 set folderNumber to text -2 thru -1 of (\"0\" &amp; i) -- 将数字转为两位数格式，如1变为01 set newFolderPath to folder1Path &amp; \"/\" &amp; folderNumber do shell script \"mkdir -p \" &amp; quoted form of newFolderPathend repeatdisplay dialog \"创建完成！\"","link":"/2023/09/16/AppleScript/"},{"title":"CF1872","text":"写在前面： 到学校第一次打 还算可以 A 签到题，基本运算，读懂题即可 ceil(x) 是对 向上取整，floor(x) 是对 向下取整 B 签到题，读懂题即可，线性扫陷阱 C 小构造题，如果范围里有大于 的偶数，那就输出 和 ，如果只有一个奇数，那就分解因数，如果有除 和它本身的因数，就输出此因数和 与此因数的差，找不到就输出 ，注意 都不符合题意需特判 D 小数学题，发现 的倍数数量相对于整体是少数，所以只需要考虑倍数， 的公倍数被加一次减一次相当于没用，于是我们求出来是 的倍数但不是 的倍数的个数以及是 的倍数但不是 的倍数的个数，依次把最大的若干数和最小的若干数填进去即可 E 看到几种做法 1. 线段树（我的做法） 2. 异或前缀和 3. 分块 感觉线段树还是比较好想的，维护区间内属于 的异或和属于 的异或和，修改就是 并打 ，我做的时候出现了一些问题，导致样例能过，但是第二个点就过不去了，最后几分钟调出来了，发现是打 的方式不对，有的 不能及时下放，在 本来就为 的节点再进行修改， 应该变为 ，我忽略了这个问题，最后切了 F 基环树森林的基本做法，先处理环下树一定最优，然后找环，环中舍掉贡献最少的边，定出一个起点按顺序输出，最劣复杂度 在一个有向图中,每一个点都有唯一的一个出边,那么这个图就是一棵基环树。 G 奇技淫巧题 发现操作肯定是选非 的数做两端更优，所以只需要枚举非 的数，处理出前缀积和前缀和，然后 枚举，有人担心 过不了，其实确实过不了，考虑一些可以直接得出答案的情况，当一段数的积够大，大到一定程度，就一定取整段 数据范围告诉我们如果什么操作都不做，所有数的和最大应该是 ，当积大于这个数时，就可以省去枚举的步骤，以 为底其的对数不超过 ，枚举飞快 第一次手撕 题纪念一下","link":"/2023/09/08/CF1872/"},{"title":"你不是第一次当新生了，应该知道怎么做了吧","text":"开学了，写点东西 day -2 大姨带着元宝来送我上火车，元宝一见到我就抱住我说：“哥哥你什么时候才回来看我啊”，真的佩服小孩子的记性，明明上了高中以后就没再见过一面了，却还是和我亲的不行 在火车站坐着，大姨让我看着元宝，却带回来一袋子麦当劳，让我上车吃，姥姥的饺子还在保温杯里，大姨说容易坏，上车先把麦当劳吃了吧，然后我就在车上吧饺子和汉堡全吃了，撑得睡不着觉 btw 退役军人证是真的爽，人们排了好长的队，但是直接从队首进到站台了 上车以后看了两集生活大爆炸就睡了，防止手机没电一直开着超级省电 day -1 早晨七点起的，好像到湖南了，早饭吃了碗泡面就回卧铺上躺着了，还做成了一项伟业：把五个箱子袋子缩减到了四个 南方的山和水比北方多多了，一会儿进一个隧道，一会儿跨一条湖，我坐在窗户前面看了一个多小时，好像被吸引住了，可能也是无聊 中午12点到广州了，和我爸我妈会和，也是这个时候知道会有台风，辅导员说可以提前入住，然后我们就直接去华工了，先坐的 号线，从广州北站到高增，再倒 号线，从高增坐到汉溪长隆，最后倒 号线，到终点站大学城南，不知道为什么，去一座城市，我就特别想坐一下，这个城市的地铁，就就就特别喜欢underground（北京地铁 号线四惠前面的那段 在志愿者的指引和导航的支持下找到了 ，打开宿舍门发现 已经到了，我才想起来 是临干，简单认识了一下就开始收拾东西了，收拾了一下午，把蚊帐弄好了就溜了，晚上住的酒店还不错 但是，酒店没有热水，我斗胆洗了发凉水澡，成功把自己弄感冒了，鼻子堵了，打喷嚏打个不停，没办法，还是睡了，睡前看到明天下午 点以后让准备好吃的和用的，要停工停业，给我吓一哆嗦，但鼻子还是堵的，难受 day 0 早晨六点，被一口气憋醒，然后就睡不着了，于是起来吃早饭，发现这里的店真的是开门好晚，七点都没几家点开门，吃了口上海小笼包就赶到学校了，继续收拾东西 收拾了一上午以后看看还缺垃圾桶、盆等大件的生活用品，看到这里便利店真的卖的有点点小贵，在学校食堂吃了第一顿饭后，我们就打车到了最近的沃尔玛，说最近也不近，打车都花了四十多，后来一想，感觉还不如在学校买呢，打车都贵的要死 下了车，不知道为啥感觉走不动道，累的不行，头也晕，有点烧，我妈觉得我又阳了，我也觉得，硬撑着买完了一些东西，打车回酒店睡了一下午，路上买了些药，吃了，好点，但不多 晚上开始下雨了，是台风吗，可能是吧，说是 号凌晨离我所在地最近，也不管啦，反正也病着，出不去 家长回去的火车停运了，找了半天候补票，最后还是没订上 day 1 今天报道，下着雨，吃了顿广东早茶就打车去华工了，收拾东西，线上报个到，去交个户口迁移证，该弄的都弄了 发现病情有点改善 我说，就在宿舍待着吧，他们说，订上票了 看到 在看闫总的课，突然想起来高一的时候自己听闫总的课，觉得这怎么可能是从我们学校出来的，我怎么没学成这样， 就退役的小 b 崽汁斗胆挑战 ，看后续吧 跟 聊了会儿天，感觉是个大佬，作息规律，还学的多，感觉卷不过的样子 /qq 跟 渗透了一下想当学习委员的意愿 晚上 买的洗衣机到了，只有我和 在宿舍，我们没管快递师傅带个推车的建议，空着手去了，然后抬着大洗衣机，从天桥底下走到宿舍底下，然后又搬上四楼，搬的满头大汗，得，病是完全好了 在宿舍待的第一个晚上，我就知道了山东有多卷，反正比河北卷 day 2 快七点起的，洗漱完， 带我去见另外几个临干和他们的室友，先见到 和 ，然后在食堂见到了 和 ，和他们一块吃早饭，我要的煎饼，感觉和北方的做法不太一样，吃起来也还行，我们因为拿体检表晚来了点所以只是安静的吃（社恐 估计是他们都提前见过了，对我还比较陌生，被 问叫什么，好像又被认错名字里的字了，果然是个易错字，高中老师每人念错一遍的威力 然后在黄老师的带领下逛了一圈校园，知道路怎么走啦，学校还是蛮大的嘛（赞赏 然后去体育馆体检了，体育馆的屋顶好像某处遗址的材质，不是很懂 去和家长告别，在正门拍了几张照片，在 ❤️ 那里拍了几张，最后吃一顿饭就回浙江了，我也带着点东西回宿舍了 回到宿舍， 又要去当志愿者，于是就我一个人了，和 视频了会，聊挺开心，回来 就告诉我他也想当学习委员，好像有点棘手，我确实胜算不太大，戴耳机，听歌，洗衣服，晾上， 来啦，帮他搬东西去，然后吃晚饭 晚上自己骑着小蓝去 新天地了，人蛮多，蛮繁华，戴着耳机，人声听不到了，只有音乐声，找点好位置拍点照，看着，走着，突然发现自己是只有自己在这座城市上了，还好吧，有点说不出的感觉 骑着车子姥姥给我打电话，第一个没接到，我说自己在洗衣服，我要是说我自己在外面逛，肯定又要被担心被拐走了 感觉黄老师确实蟀 day 3 报道第三天，早晨吃饭带上 了， 又认了一下，吃完去拿快递回宿舍了 我跟 说我改成科创委员吧，我还是蛮好说话的（自豪 下午我想出去玩，问他们去不去，然后就都去了，去的北京路，坐了一个小时地铁，到了一个比较古老又繁华的道路上，左边是古老的破旧不堪的建筑，残留着上个世纪的遗韵，右边是大商场，展示着繁华大都市的脸面，稍微转了转，在这里可以看到无轨电车，相当于公交，但是上面连着线，第一次见，新鲜事物 去吃冰，点了个里面有芒果和奶皮的甜品还有抹茶味的（应该是）冰沙，做的好高，分量挺足，就是吃完容易窜，就像 一样 然后我们去大沙头游船码头坐船去啦，一个人 块钱，还可以，主要是江风太好吹了，感觉一切不好的事都能被它吹走，然后只留下享受，大桥从头顶上略过，广州塔从身旁游过，想用无人机拍下来这样的景象 船上有专门的摄影师，先给你拍照，然后给你洗出来装上纸质相框，问你要三十块拿走，最后我们自己在船上拍了一张，能体会一次就不错 今天最后一位同仁 来了， 宿舍齐活，直接启动！ day 4 因为明天要考试了，所以打算复习复习，上午听了个四级听力，错了 个，再听一个，听不下去了，听不懂，然后开始写阅读，错了 个，不写了 拿快递，然后拿快递，然后更新桌面，二阶段宿舍改造计划启动 晚上有学生会招新，去听了听，看中了三个：外联部、宣传部、学术科技部，最后报了外联和宣传 试了下收音机，金属味有点重 day 5 早晨吃完饭去照片采集，碰到 ， 看了看考场，回宿舍歇着了 看了看单词，还是有点不放心收音效果，就没带收音机（惊（不是故意的（带了个空盒子（以为带上了，慌得我直接找旁边刚考完的人借了个，最后还没用到 在 门口看到了 力（喜 中午吃的意面，不好吃，差评 取快递，三阶段宿舍改造计划启动 晚上开学典礼，去食堂感觉不想吃，就买了瓶可乐去音乐厅后面的座位上歇着了，看 说编程领域 的使用率还是比较高的，瞬间舒心 听课听的很认真，有被教育到了，要好好学习咯，睡觉啦 /dy day 6 下了一天雨，在宿舍待了一整天，中午饭晚上饭都在宿舍吃零食，根本不想出宿舍 上午敲了一上午代码，打了会音游，下午睡到 点半，起来梦了会游，去面试外联部了，口才不太好，想到的都没说出来，感觉不是太妙 晚上说是有集会但是大雨倾盆，逃了 到床上打 找手感，切了 道，感觉良好 day 7 依然在下雨，上午是班级破冰活动，早上准备去，拿上新买的雨伞，但是发现坏了，我才用了一次啊 /dk，结果在楼下买了个高达 元的雨伞，早饭都没吃就去了 时间好像只有一个半小时，比较紧，让所有人简单介绍了下自己，然后又让班委竞选了一下（然而每个班委只有一个人竞选）没尬住，大胜利 搞完去拿快递，发现都不知道自己取了哪个没取哪个，取了个寂寞，回来就在遇见小面找了个座位吃了 块钱的软骨丸子汤面、羊肉串还有冰粉，还不错，就是有点贵 回到宿舍发现自己耳机进水了一样，一直有电流声，md我快两百块钱买的啊，怎么这么不经用 下午干正事 晚上听詹书记教育我们，感觉讲课跟 一样抽象，喜欢举例子，喜欢说看似废话的话，意识流式讲话，原来有学识的人都是这么讲话，爱了爱了 day 8 今天上午是全校的开学典礼，下午是全校的新生安全教育，一散会就被叫去搬书了，分完书回宿舍写作业，写到半夜才写完 day 9 今天早晨起晚了，赶忙去七楼面试宣传部，平稳地完成了，晚上告诉我通过了 yeah 打算出去玩，简单找了找资料，首先先去坐了有轨电车，从万胜围到广州塔，发现那里有步行桥可以跨珠江，觉得傍晚来风景最好，就预约了六点到七点的时间，然后坐 线去广州图书馆和广州博物馆，座位和大厅是没有隔离连着的，感觉人多的话工作看书会有点吵，逛了一圈出来想去博物馆，发现需要预约并且当天已经预约满了，就只能换个地方去了，去了旁边的 艺术购物中心，上流人士的游览场所，有钢琴表演，金碧辉煌，我这种土狗逛了逛就溜了，溜去彩虹桥旁边的西华路吃小吃，彩虹桥确实是个很魔幻的地铁站，非常大，天花板上装饰着彩虹，西华路上人一般多，只有那么几家网红店门口排着长队，剩下的店里都看不到顾客，我点了一份煎饺还有一杯杨枝甘露，还是蛮好吃的，回图书馆看了会书，就去广州塔的步行桥上欣赏日落了，但是太阳看不见一点，扫兴地去五山校区听华南虎宣讲会了，看到好多名人，抽奖还中奖了（喜，想加入，但是再看看吧 明天就开课了，新生记录就先这样完结吧，先让我学学怎么学习大学的知识……","link":"/2023/09/06/new-student/"},{"title":"tarjan","text":"写在前面：图论中一个非常重要的算法—— 算法 tarjan 总述 有向图中的tarjan 强连通分量 点双连通分量 边双连通分量 无向图中的tarjan 割边 模板题：1192. 查找集群内的关键连接 - 力扣（LeetCode） 割点 模板题：P3388 【模板】割点（割顶） - 洛谷 | 计算机科学教育新生态 (luogu.com.cn)","link":"/2023/08/12/tarjan/"},{"title":"练一些分治题","text":"写在前面：分治这个东西好像容易被大家忘记，专门找一些题练练 Luogu P1429 分治基本思想，确定一个分割点，各自处理左右两部分答案，最后合并答案 先考虑一维，确定一个中间点，假设左右分别都求出来了最近点对，然后需要求整个部分的答案，需要考虑跨分界点的点对，设 为左右两边答案中小的那个，只需要考虑分界点左右距离为 内的点，至多有两个点，复杂度降到 二维一样，按其中一维像上面做之后，把另一维排序，取靠近分界点的点进行枚举，枚举也无须做到平方级别，每个点只需要尽可能枚举相近的点即可，可以证明点数不超过 个，复杂度降到 LOJ #6490 也是区间分成两半去考虑，当两边的答案处理好之后，需要考虑跨过 的区间 以左边为例，依次枚举左端点 ，求出跨 的长度在 的区间中最大的区间，具体用前缀和 + 表实现 查找，记录下来 再往后扫， 的答案就是 ， 一定是在 记录的最大区间里面的 右边同样，注意开要","link":"/2023/09/07/%E5%88%86%E6%B2%BB/"},{"title":"四级作文备考","text":"写在前面：没什么好写的，就是复习作文素材 ep1 Mobile Games ​ Nowadays mobile phones have become an inseparable social networking tool for college students,which results in the popularity of mobile games.Evidently,they exert a profound impact on the life of comtemporary college students. ​ Admittedly,playing mobile games is a good way to relieve stress and anxiety.Interactive entertainment provides tangible benefits,such as hand-eye coordination,the increase in brain's activity and the boost in creativity.Also,competitve games can improve participants' team-building skills,which are essential to their academic cooperation. ​ However,playing mobile games also has negative impacts on many college students.Some would become easily addicted to mobile games due to lack of self-control.Staring at mobile screens for many hours would lead to a sedentary lifestyle,causing eyestrain or headaches.Besides,too much exposure to violent languages and scenes will likely make college students more aggressive. ​ In all,mobile games should be used in a rational way,and college students should maximize their benefits to achieve bigger success in their future life. ep2 Online Shopping ​ Buying and selling online has become important parts of many people's lives.Consumers have embraced online shopping as a cheaper and more convenient way to buy what they want.However,the fact that shopping online is not really a cheap way cannot be neglected. ​ Attracted by discount coupons or other types of overwhelming promotions,consumers tend to overspend online.Sadly,a large proportion of those items they have bought online are later found unnecessary or useless.Once consumers want to return those items,they may be required to pay a return fee.Consumers also face losses on products like fruits and vegetables,which are very unlikely to be kept 100% fresh during transportation.Moreover,to achieve higher sales,unscrupulous businesses may display misleading,exaggerated and fraudulent information,leading to a higher risk of fraud and a huge loss of money for consumers. ​ Therefore,to enjoy a truly lower price of online products,we should go through websites carefully,and think twice before we choose to pay for the products.","link":"/2023/08/08/%E8%8B%B1%E8%AF%AD%E6%96%87%E7%AB%A0/"},{"title":"康复训练","text":"写在前面：已经快一年没coding了，所以打算利用这一个月时间进行一个手感的找回，也好为 打下基础 2023.8.6 leetcode 6953 脑筋急转弯，正难则反 leetcode 2813 一开始没想到，看题解后知道是反悔贪心，然后就写了一个错误答案 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859606162636465class Solution {public: struct cmp2{ bool operator()(const pair&lt;int, int&gt; &amp;a, const pair&lt;int, int&gt; &amp;b){ return a.first &gt; b.first; } }; pair&lt;int,int&gt; s[100010]; priority_queue&lt; pair&lt;int,int&gt; , vector&lt;pair&lt;int,int&gt; &gt;,cmp2 &gt; p; int n,tmp=0,lx=0,sum[100010]; static bool cmp1(pair&lt;int,int&gt; a,pair&lt;int,int&gt; b){ if(a.first==b.first) return a.second&lt;b.second; return a.first&gt;b.first; } long long findMaximumElegance(vector&lt;vector&lt;int&gt;&gt;&amp; items, int k) { n=items.size(); for(int i=1;i&lt;=n;i++){ s[i]=make_pair(items[i-1][0],items[i-1][1]); } sort(s+1,s+1+n,cmp1); for(int i=1;i&lt;=k;i++){ if(sum[s[i].second]==0){ lx++; sum[s[i].second]=1; tmp+=s[i].first; }else{ sum[s[i].second]++; tmp+=s[i].first; p.push(make_pair(s[i].first,s[i].second)); } } tmp+=lx*lx; if(p.empty()) return tmp; for(int i=k+1;i&lt;=n;i++){ if(sum[s[i].second]){continue;} int tmp1=tmp; while(!p.empty()&amp;&amp;sum[p.top().second]&lt;=1) p.pop(); if(p.empty()) return tmp; auto t=p.top(); tmp1-=t.first; tmp1+=s[i].first; tmp1-=lx*lx; tmp1+=(lx+1)*(lx+1); if(tmp1&gt;tmp){ lx++; tmp=tmp1; p.pop(); sum[t.second]--; sum[s[i].second]++; } } return tmp; }}; 原谅我的马蜂，意思就是先按利润排序，然后先取前 个，以取前 个这个状态为基准，判断加进来一个会否会使结果变大，如果会那就取，再以这个状态为基准判断下一个，如果不会那就不取，相当于舍弃掉这个东西了 ： 1items=[[10,1],[10,1],[10,1],[10,1],[10,1],[10,1],[10,1],[10,1],[10,1],[10,1],[3,2],[3,3],[3,4],[3,5],[3,6],[3,7],[3,8],[3,9],[3,10],[3,11]] k=10 1137 正解是以前 个这个状态为下界，然后尽可能往后取不同类别的东西，答案中类别数的平方使得线性的决策不一定正确，而贪心的思想告诉我们应该尽可能取不同类别的东西，严格来说正解才能称得上是贪心 AGC064A 有点意思的构造题 leetcode 1444 预处理+dp leetcode 1388 问题转化+环形dp的经典题型，取不相邻的最值，去头去尾分别dp取最值，不然就得存到状态里 ABC315E 建反图统计 的可达点，然后按拓扑序输出 ABC315D 快学英语吧，题都看错了…… ABC315F 向后传递 题，注意不需要跳过太多点，只需要讨论跳过 个以内的点的情况，于是可以把复杂度降到","link":"/2023/08/06/%E5%BA%B7%E5%A4%8D%E8%AE%AD%E7%BB%83/"}],"tags":[{"name":"AppleScript","slug":"AppleScript","link":"/tags/AppleScript/"},{"name":"CodeForces","slug":"CodeForces","link":"/tags/CodeForces/"},{"name":"life","slug":"life","link":"/tags/life/"},{"name":"C++","slug":"C","link":"/tags/C/"},{"name":"tarjan","slug":"tarjan","link":"/tags/tarjan/"},{"name":"分治","slug":"分治","link":"/tags/%E5%88%86%E6%B2%BB/"},{"name":"English","slug":"English","link":"/tags/English/"}],"categories":[]}